Script started on Mon 09 Feb 2015 04:46:42 PM PST
You are currently using 62% (630.4 MiB) of your 1.0 GiB quota.
]0;apa10@be-linux40:lab5[apa10@be-linux40 lab5]$ mk list2.c
CSOURCE=err2.c EXECBIN=err2
+ cid + err2.c
+ checksource err2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 err2.c -o err2 -lm
+ tee err2.c.log
err2.c: In function â€˜mainâ€™:
err2.c:6:14: warning: initialization makes pointer from integer without a cast [enabled by default]
    char *p = 20;
              ^
+ set +x
============================================================
CSOURCE=err.c EXECBIN=err
+ cid + err.c
+ checksource err.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 err.c -o err -lm
+ tee err.c.log
err.c: In function â€˜fooâ€™:
err.c:6:9: warning: unused variable â€˜pâ€™ [-Wunused-variable]
    int *p = &x;
         ^
err.c: In function â€˜barâ€™:
err.c:11:11: warning: â€˜aâ€™ is used uninitialized in this function [-Wuninitialized]
    printf ("%d %p\n", a, p);
           ^
err.c:11:11: warning: â€˜pâ€™ is used uninitialized in this function [-Wuninitialized]
+ set +x
============================================================
CSOURCE=hello.c EXECBIN=hello
+ cid + hello.c
+ checksource hello.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 hello.c -o hello -lm
+ tee hello.c.log
+ set +x
============================================================
CSOURCE=list1.c EXECBIN=list1
+ cid + list1.c
+ checksource list1.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list1.c -o list1 -lm
+ tee list1.c.log
list1.c: In function â€˜mainâ€™:
list1.c:15:7: warning: implicit declaration of function â€˜mallocâ€™ [-Wimplicit-function-declaration]
       node *node = malloc (sizeof (struct node));
       ^
list1.c:15:20: warning: incompatible implicit declaration of built-in function â€˜mallocâ€™ [enabled by default]
       node *node = malloc (sizeof (struct node));
                    ^
list1.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
+ tee list2.c.log
list2.c: In function â€˜mainâ€™:
list2.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
CSOURCE=malloc.c EXECBIN=malloc
+ cid + malloc.c
+ checksource malloc.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 malloc.c -o malloc -lm
+ tee malloc.c.log
malloc.c: In function â€˜mainâ€™:
malloc.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
malloc.c:12:28: warning: unused parameter â€˜argvâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
                            ^
+ set +x
============================================================
CSOURCE=uninit.c EXECBIN=uninit
+ cid + uninit.c
+ checksource uninit.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 uninit.c -o uninit -lm
+ tee uninit.c.log
uninit.c: In function â€˜mainâ€™:
uninit.c:6:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
uninit.c:6:28: warning: unused parameter â€˜argvâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
                            ^
uninit.c:8:11: warning: â€˜pointerâ€™ is used uninitialized in this function [-Wuninitialized]
    printf ("pointer=%p\n", pointer);
           ^
uninit.c:11:11: warning: â€˜fooâ€™ is used uninitialized in this function [-Wuninitialized]
    printf ("foo=%d\n", foo);
           ^
+ set +x
============================================================
]0;apa10@be-linux40:lab5[apa10@be-linux40 lab5]$ valg[Kgrind list2.c[K[K foo bar
==28634== Memcheck, a memory error detector
==28634== Copyright (C) 2002-2013, and GNU GPL'd, by Julian Seward et al.
==28634== Using Valgrind-3.9.0 and LibVEX; rerun with -h for copyright info
==28634== Command: list2 foo bar
==28634== 
0x4c2c180->node {word=0xffefffce5->[ORBIT_SOCKETDIR=/tmp/orbit-apa10], link=0x4c2c130}
0x4c2c130->node {word=(nil)->[(null)], link=0x4c2c0e0}
0x4c2c0e0->node {word=0xffefffce1->[bar], link=0x4c2c090}
0x4c2c090->node {word=0xffefffcdd->[foo], link=0x4c2c040}
==28634== Conditional jump or move depends on uninitialised value(s)
==28634==    at 0x400682: main (list2.c:21)
==28634== 
==28634== 
==28634== HEAP SUMMARY:
==28634==     in use at exit: 80 bytes in 5 blocks
==28634==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==28634== 
==28634== LEAK SUMMARY:
==28634==    definitely lost: 16 bytes in 1 blocks
==28634==    indirectly lost: 64 bytes in 4 blocks
==28634==      possibly lost: 0 bytes in 0 blocks
==28634==    still reachable: 0 bytes in 0 blocks
==28634==         suppressed: 0 bytes in 0 blocks
==28634== Rerun with --leak-check=full to see details of leaked memory
==28634== 
==28634== For counts of detected and suppressed errors, rerun with: -v
==28634== Use --track-origins=yes to see where uninitialised values come from
==28634== ERROR SUMMARY: 1 errors from 1 contexts (suppressed: 6 from 6)
]0;apa10@be-linux40:lab5[apa10@be-linux40 lab5]$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux 7.6.1-47.el6
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/c/apa10/lab12m/lab5/list2...done.
(gdb) break 25
Breakpoint 1 at 0x400684: file list2.c, line 25.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/c/apa10/lab12m/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

0x601090->node {word=0x7fffffffdbb5->[ORBIT_SOCKETDIR=/tmp/orbit-apa10], link=0x601070}
0x601070->node {word=(nil)->[(null)], link=0x601050}
0x601050->node {word=0x7fffffffdbb1->[bar], link=0x601030}
0x601030->node {word=0x7fffffffdbad->[foo], link=0x601010}

Breakpoint 1, main (argc=3, argv=0x7fffffffd7e8) at list2.c:25
25	   return 9;
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.149.el6_6.5.x86_64
(gdb) where
#0  main (argc=3, argv=0x7fffffffd7e8) at list2.c:25
(gdb) list
20	   }
21	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
22	      printf ("%p->node {word=%p->[%s], link=%p}\n",
23	              curr, curr->word, curr->word, curr->link);
24	   }
25	   return 9;
26	}
(gdb) list list2.c:23
18	      node->link = head;
19	      head = node;
20	   }
21	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
22	      printf ("%p->node {word=%p->[%s], link=%p}\n",
23	              curr, curr->word, curr->word, curr->link);
24	   }
25	   return 9;
26	}
(gdb) print head
$1 = (node *) 0x601090
(gdb) bt
#0  main (argc=3, argv=0x7fffffffd7e8) at list2.c:25
(gdb) print head
$2 = (node *) 0x601090
(gdb) print head*head
$3 = {word = 0x7fffffffdbb5 "ORBIT_SOCKETDIR=/tmp/orbit-apa10", link = 0x601070}
(gdb) print *head(head[C[C[C[C->word)
$4 = 79 'O'
(gdb) print head [K->linl[Kk->link->link=[K->link[K[K[K[K[K[K
$5 = (node *) 0x601030
(gdb) print head->link->link->link*head->link->link->link[C[C[C[C[C[C[C[C[C[C[C[C[C(head->link->link->link[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C)
$6 = {word = 0x7fffffffdbad "foo", link = 0x601010}
(gdb) quit
A debugging session is active.

	Inferior 1 [process 28817] will be killed.

Quit anyway? (y or n) y
]0;apa10@be-linux40:lab5[apa10@be-linux40 lab5]$ exx[Kit
exit

Script done on Mon 09 Feb 2015 04:49:24 PM PST
