Script started on Mon 09 Feb 2015 04:14:45 PM PST
You are currently using 62% (630.4 MiB) of your 1.0 GiB quota.
]0;apa10@be-linux40:lab5[apa10@be-linux40 lab5]$ val[K[Kexitgdb list1.c[26Gvalgrind list1[27Gim part05.typescript[27Galgrind list1[K
==26629== Memcheck, a memory error detector
==26629== Copyright (C) 2002-2013, and GNU GPL'd, by Julian Seward et al.
==26629== Using Valgrind-3.9.0 and LibVEX; rerun with -h for copyright info
==26629== Command: list1
==26629== 
0x4c2c180->node {word=0xffefffd26->[IMSETTINGS_INTEGRATE_DESKTOP=yes], link=0x4c2c130}
0x4c2c130->node {word=0xffefffd06->[HOSTNAME=be-linux40.lt.ucsc.edu], link=0x4c2c0e0}
0x4c2c0e0->node {word=0xffefffce5->[ORBIT_SOCKETDIR=/tmp/orbit-apa10], link=0x4c2c090}
0x4c2c090->node {word=(nil)->[(null)], link=0x4c2c040}
==26629== Conditional jump or move depends on uninitialised value(s)
==26629==    at 0x400682: main (list1.c:21)
==26629== 
==26629== 
==26629== HEAP SUMMARY:
==26629==     in use at exit: 80 bytes in 5 blocks
==26629==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==26629== 
==26629== LEAK SUMMARY:
==26629==    definitely lost: 16 bytes in 1 blocks
==26629==    indirectly lost: 64 bytes in 4 blocks
==26629==      possibly lost: 0 bytes in 0 blocks
==26629==    still reachable: 0 bytes in 0 blocks
==26629==         suppressed: 0 bytes in 0 blocks
==26629== Rerun with --leak-check=full to see details of leaked memory
==26629== 
==26629== For counts of detected and suppressed errors, rerun with: -v
==26629== Use --track-origins=yes to see where uninitialised values come from
==26629== ERROR SUMMARY: 1 errors from 1 contexts (suppressed: 6 from 6)
]0;apa10@be-linux40:lab5[apa10@be-linux40 lab5]$ gdb list1
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux 7.6.1-47.el6
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/c/apa10/lab12m/lab5/list1...done.
(gdb) break main
Breakpoint 1 at 0x4005bf: file list1.c, line 14.
(gdb) run
Starting program: /afs/cats.ucsc.edu/users/c/apa10/lab12m/lab5/list1 
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=1, argv=0x7fffffffd808) at list1.c:14
14	   for (int argi = 0; argi < 5; ++argi) {
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.149.el6_6.5.x86_64
(gdb) p[Knext
15	      node *node = malloc (sizeof (struct node));
(gdb) print node [K
$1 = (node *) 0x0
(gdb) print node*[K[K[K[K[K([K*node
Cannot access memory at address 0x0
(gdb) next
16	      assert (node != NULL);
(gdb) next
17	      node->word = argv[argi];
(gdb) next
18	      node->link = head;
(gdb) next
19	      head = node;
(gdb) print node
$2 = (node *) 0x601010
(gdb) print node*node
$3 = {word = 0x7fffffffdb82 "/afs/cats.ucsc.edu/users/c/apa10/lab12m/lab5/list1", 
  link = 0x0}
(gdb) quit
A debugging session is active.

	Inferior 1 [process 26632] will be killed.

Quit anyway? (y or n) y
]0;apa10@be-linux40:lab5[apa10@be-linux40 lab5]$ exit
exit

Script done on Mon 09 Feb 2015 04:16:16 PM PST
