Script started on Mon 09 Feb 2015 05:23:13 PM PST
You are currently using 62% (631.5 MiB) of your 1.0 GiB quota.
]0;apa10@unix1:lab5[apa10@unix1 lab5]$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux 7.6.1-47.el6
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/c/apa10/lab12m/lab5/list2...done.
(gdb) f[Krun foo bar[K[K[K[K[K[K[K[K[K[K[Kbreak main
Breakpoint 1 at 0x4005bf: file list2.c, line 14.
(gdb) run food[K bar
Starting program: /afs/cats.ucsc.edu/users/c/apa10/lab12m/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=3, argv=0x7fffffffde18) at list2.c:14
14	   for (int argi = 0; argi < 5; ++argi) {
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.149.el6_6.5.x86_64
(gdb) orubt[K[K[K[K[Kprint argc
$1 = 3
(gdb) print argv
$2 = (char **) 0x7fffffffde18
(gdb) print argv[0]
$3 = 0x7fffffffe0f9 "/afs/cats.ucsc.edu/users/c/apa10/lab12m/lab5/list2"
(gdb) print argv[0][1P]1]
$4 = 0x7fffffffe12c "foo"
(gdb) print argv[1][1P]3]
$5 = 0x0
(gdb) print argv[3][1P]4]
$6 = 0x7fffffffe134 "USER=apa10"
(gdb) print argv[4][1P]5]
$7 = 0x7fffffffe13f "LOGNAME=apa10"
(gdb) print argv[5][1P]6]
$8 = 0x7fffffffe14d "HOME=/afs/cats.ucsc.edu/users/c/apa10"
(gdb) quit
A debugging session is active.

	Inferior 1 [process 24545] will be killed.

Quit anyway? (y or n) y
]0;apa10@unix1:lab5[apa10@unix1 lab5]$ exit
exit

Script done on Mon 09 Feb 2015 05:26:27 PM PST
